import time
def hello_user():
    print("hello, მე ელიოტი ვარ შენი ვირტუალური ფსიქოლოგი თუ იმის კომპლექსი გაქვს რომ რეალობაში უცხო ადამიანს უამბო რა გაწუხებს მე ჩემი ხელოვნური ინტელექტით ვეცდები ნებისმიერ საკითხთან დაკავშირებით მოგცე: რჩევები, რეკომენდაციები გაჩვენო სწორი გზა... შემდეგ თავად გადაწყვიტე ვარ შენს იაფ ფასიან მეგობრებზე უფრო კარგი მოსაუბრე თუ არა :)")
hello_user()
print("დავიწყოთ :)")
for seconds in range(3,0,-1):
    print(seconds)
    time.sleep(1) 
print("არ შეგაშინოს პირადთან ასოცირებულ კითხვებმა რადგან ჩემი მოვალეობაა შენზე ბევრი რამ ვიცოდე რომ სწორი რჩევები მოგცე")   
while True:
    name = input("გამარჯობა,თქვენი სახელი როგორ მოგმართოთ ? *_*?")
    if name != "" :
        break
    if (name[0].islower()):
        name = name.capitalize()
i = name
print("სასიამოვნოა" + name + "მე ხელოვნური ინტელექტი სახელად ელიოტი მოგესალმებით ჩემს სამყაროში ^_^")
age = str(input("რამდენი წლის ხართ? :)"))

print("მშვენიერია თქვენ ხართ: " + str(age)+ " წლის")
if int(age) >= 18 :
    print("თქვენ სრულწლოვანი ხართ და შეგიძლია ისარგებლოთ პროგრამით")
if int(age) < 18:
    print("სამწუხაროდ თქვენ არ ხართ სრუწლოვანი,რაც ჩვენი პროგრამის კონდინციებში არ არის მისაღები")
elif age == str: 
    print("შეუსაბამო პასუხის გამო თქვენ ოპერაციის გამეორება მოგიწევთ")


height = float(input("რამდენი ხართ სიმაღლეში ? ^_^: "))
print("WOW! your height is:" + str(height))
if height >= 2.0 :
    print("Fuck Off, გიგანტი ხართ ვერცერთი კონტენტით ვერ გაგაოცებთ, მაგრამ მცდელობას ყოველთვის აქვს აზრი :)")
if height >= 1.70:
    print("თქვენი სიმაღლისდა მიუხედავად შევეცდებით შესაბამისი ვლოგები შემოგთავაზოთ")
if height <= 1.70: 
    print("თქვენი სიმაღლისდა მიუხედავად შევეცდებით შესაბამისი ვლოგები შემოგთავაზოთ")
if height >= 1.60: 
    print("თქვენი სიმაღლე მიანიშნებს პროგრამას რომ უფრო ნაკლებად ფიზიკურად დამტვირთავი პოსტები გაგიზიაროთ ")        
elif height < 1.50: 
    print("შეუსაბამო პასუხის გამო თქვენ ოპერაციის გამეორება მოგიწევთ")
# if statement


for seconds in range(10,0,-1):
    print("გთხოვთ დაიცადოთ სულ რაღაც 10 წამით,მოტივაციისთვის")
    print(seconds)
    time.sleep(1)
print("რაც არუნდა მოხდეს არასდროს დანებდეთ თქვენ ყველაფერს მიაღწევთ,ცხოვრება მეტისმეტად ხანგრძლივია ამისთვის ამის საშუალება სწორედ ამიტომ გვეძლევა,ყოველდღე,ყოველ დღეს შენ შეგიძლია შეცვალო შენი ცხოვრება <3!")


rows = int(input("შეავსეთ პროცენტულად იმ სიმბოლოების სიგრძე რამდენად რთული ცხოვრებაც გაქვთ: "))
columns = int(input("შეავსეთ სიმაღლე იმის მიხედვით თუ რამდენად კმაყოფილი ხართ თქვენი ცხოვრებით: "))
symbol = input("რა სიმბოლოებით გსურთ რომ გამოისახოს სიმბოლოების სიგრძე და სიმაღლე?: ")

for i in range(rows):
    for j in range(columns):
        print(symbol, end="")
    print()
